gsocproposal-thread-safe-hash-table/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-26 Sun 03:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Compro Prasad" />
</head>
<body>
<div id="content">
<div id="outline-container-org85021e7" class="outline-2">
<h2 id="org85021e7"><span class="section-number-2">1</span> Name</h2>
<div class="outline-text-2" id="text-1">
<p>
Abhishek Prasad
</p>
</div>
</div>
<div id="outline-container-org281aabd" class="outline-2">
<h2 id="org281aabd"><span class="section-number-2">2</span> Your email address</h2>
<div class="outline-text-2" id="text-2">
<p>
comproprasad@gmail.com
</p>
</div>
</div>
<div id="outline-container-org4b8dd17" class="outline-2">
<h2 id="org4b8dd17"><span class="section-number-2">3</span> The name of the project</h2>
<div class="outline-text-2" id="text-3">
<p>
GNU Clisp
</p>
</div>
</div>
<div id="outline-container-org2dbe3f9" class="outline-2">
<h2 id="org2dbe3f9"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
In simple terms I will be implementing thread safe hash tables in the core of
GNU Clisp.
</p>
</div>
</div>
<div id="outline-container-org051b296" class="outline-2">
<h2 id="org051b296"><span class="section-number-2">5</span> Benefits</h2>
<div class="outline-text-2" id="text-5">
<p>
Having threading support is necessary everywhere from normal computing tasks to
larger applications running on production environments like servers. The problem
arises when the data being used in threads are not atomic in nature. Most of
data structures are thread safe in nature except the hash tables which are also
extensively used in <a href="https://sourceforge.net/p/clocc/hg/ci/default/tree/">CLOCC</a>.
</p>

<p>
Since I am doing this project I will get to know how threads, mutexes and hash
tables are used in writing a program like GNU Clisp. And overall I would be
communicating with great people in the GNU community I would learn other side
stuffs too which will be an additional gift for me.
</p>
</div>
</div>
<div id="outline-container-org5b255af" class="outline-2">
<h2 id="org5b255af"><span class="section-number-2">6</span> Things to be delivered</h2>
<div class="outline-text-2" id="text-6">
<p>
Since, my work is consists of threading and hash table so the files to be dealt
with are <code>src/zthread.d</code>, <code>src/xthread.d</code> and <code>src/hashtabl.d</code> and may be some
of the related lisp files.
</p>

<p>
Leapfrog hash tables are faster to probe so they will probably be used
</p>
</div>
</div>
<div id="outline-container-org9cb8214" class="outline-2">
<h2 id="org9cb8214"><span class="section-number-2">7</span> Plan</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Work</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">04-May to 30-May</td>
<td class="org-left">Talking to the developer team, fixing small bugs and</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">get acquainted with the project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">31-May to 11-June</td>
<td class="org-left">Writing the lisp code to make simple threads and find</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">out where the hash table hits a corner case. Get ready</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">with enough tests.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">09-June to 30-June</td>
<td class="org-left">Write functions to handle the thread safety in the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">hash tables.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">25-June to 15-July</td>
<td class="org-left">Have the functions run against the test cases</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">10-July to 20-July</td>
<td class="org-left">Write the tests that were missed beforehand</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">18-July to 25-July</td>
<td class="org-left">Make the code more portable to run on different</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">platforms</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">23-July to 30-July</td>
<td class="org-left">Polishing the code to be more readable for future</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">development</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga376edc" class="outline-2">
<h2 id="orga376edc"><span class="section-number-2">8</span> Communication</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://sourceforge.net/p/clisp/mailman/clisp-devel/">clisp-devel</a> mailing list archives on source forge is subscribed both via email
and RSS feeds. <a href="https://sourceforge.net/p/clisp/mailman/clisp-announce/">clisp-announce</a> is the place where announcements are made.
User bugs are available on <a href="https://sourceforge.net/p/clisp/mailman/clisp-list/">clisp-list</a>.
</p>

<p>
I have also asked some questions to the GNU Clisp developers who have helped me
most of the time but I am loving the new things that I learn when I communicate.
</p>
</div>
</div>
<div id="outline-container-org6d732d7" class="outline-2">
<h2 id="org6d732d7"><span class="section-number-2">9</span> Qualification</h2>
<div class="outline-text-2" id="text-9">
<p>
I have written a mathematical expression calculator and have optimized as much
as possible. So, I am well acquainted with programming in C/C++ using Makefiles.
I also like designing/programming core stuff like a compiler or a kernel or a
DBMS.
</p>

<p>
Since, I am an Emacs user for around a year so I have started to like ELisp and
gradually lisp too.
</p>

<ul class="org-ul">
<li>National Institute of Technology, Durgapur</li>
<li>Bachelor's course in Information Technology</li>
<li>Second(2nd year or 4th semester) year</li>
<li>Multi threading concept is in 4th semester</li>
<li>Hash Tables were taught in the 3rd semester</li>
<li>Basics of <code>pthread.h</code></li>
<li>Written a mathematical expression calculator</li>
<li>Makefiles</li>
<li>Bash</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Compro Prasad</p>
<p class="date">Created: 2017-03-26 Sun 03:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
